; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-15)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl2)
	(at plane2 city4)
	(fuel-level plane2 fl0)
	(at plane3 city4)
	(fuel-level plane3 fl6)
	(at plane4 city9)
	(fuel-level plane4 fl5)
	(at plane5 city4)
	(fuel-level plane5 fl0)
	(at person1 city0)
	(at person2 city2)
	(at person3 city0)
	(at person4 city9)
	(at person5 city9)
	(at person6 city10)
	(at person7 city5)
	(at person8 city4)
	(at person9 city10)
	(at person10 city5)
	(at person11 city4)
	(at person12 city4)
	(at person13 city3)
	(at person14 city3)
	(at person15 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane4 city4)
	(at plane5 city10)
	(at person1 city7)
	(at person2 city6)
	(at person3 city6)
	(at person4 city0)
	(at person5 city10)
	(at person6 city2)
	(at person7 city0)
	(at person8 city1)
	(at person9 city4)
	(at person10 city9)
	(at person11 city9)
	(at person12 city1)
	(at person13 city1)
	(at person14 city0)
	(at person15 city10)
	))

)

; plan
1. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 0 of 18
2. (fly plane5 city4 city10 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 1 of 18
3. (board person9 plane5 city10)
   deleted: (at person9 city10)
   added: (in person9 plane5)
   goals met: 1 of 18
4. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 1 of 18
5. (board person6 plane5 city10)
   deleted: (at person6 city10)
   added: (in person6 plane5)
   goals met: 1 of 18
6. (board person5 plane4 city9)
   deleted: (at person5 city9)
   added: (in person5 plane4)
   goals met: 1 of 18
7. (zoom plane4 city9 city2 fl5 fl4 fl3)
   deleted: (at plane4 city9) (fuel-level plane4 fl5)
   added: (at plane4 city2) (fuel-level plane4 fl3)
   goals met: 1 of 18
8. (board person2 plane4 city2)
   deleted: (at person2 city2)
   added: (in person2 plane4)
   goals met: 1 of 18
9. (zoom plane4 city2 city3 fl3 fl2 fl1)
   deleted: (at plane4 city2) (fuel-level plane4 fl3)
   added: (at plane4 city3) (fuel-level plane4 fl1)
   goals met: 1 of 18
10. (board person14 plane4 city3)
   deleted: (at person14 city3)
   added: (in person14 plane4)
   goals met: 1 of 18
11. (board person13 plane4 city3)
   deleted: (at person13 city3)
   added: (in person13 plane4)
   goals met: 1 of 18
12. (board person8 plane3 city4)
   deleted: (at person8 city4)
   added: (in person8 plane3)
   goals met: 1 of 18
13. (board person12 plane3 city4)
   deleted: (at person12 city4)
   added: (in person12 plane3)
   goals met: 1 of 18
14. (zoom plane3 city4 city1 fl6 fl5 fl4)
   deleted: (at plane3 city4) (fuel-level plane3 fl6)
   added: (at plane3 city1) (fuel-level plane3 fl4)
   goals met: 1 of 18
15. (debark person8 plane3 city1)
   deleted: (in person8 plane3)
   added: (at person8 city1)
   goals met: 2 of 18
16. (debark person12 plane3 city1)
   deleted: (in person12 plane3)
   added: (at person12 city1)
   goals met: 3 of 18
17. (board person11 plane2 city4)
   deleted: (at person11 city4)
   added: (in person11 plane2)
   goals met: 3 of 18
18. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 18
19. (fly plane2 city4 city9 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 3 of 18
20. (board person4 plane2 city9)
   deleted: (at person4 city9)
   added: (in person4 plane2)
   goals met: 3 of 18
21. (refuel plane2 city9 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 18
22. (debark person11 plane2 city9)
   deleted: (in person11 plane2)
   added: (at person11 city9)
   goals met: 4 of 18
23. (fly plane2 city9 city0 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 4 of 18
24. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   goals met: 5 of 18
25. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   goals met: 5 of 18
26. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 5 of 18
27. (zoom plane1 city0 city6 fl2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 5 of 18
28. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 18
29. (debark person3 plane1 city6)
   deleted: (in person3 plane1)
   added: (at person3 city6)
   goals met: 6 of 18
30. (fly plane1 city6 city7 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 6 of 18
31. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 18
32. (debark person1 plane1 city7)
   deleted: (in person1 plane1)
   added: (at person1 city7)
   goals met: 7 of 18
33. (fly plane1 city7 city4 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 8 of 18
34. (fly plane5 city10 city2 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 7 of 18
35. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 7 of 18
36. (debark person6 plane5 city2)
   deleted: (in person6 plane5)
   added: (at person6 city2)
   goals met: 8 of 18
37. (board person15 plane5 city2)
   deleted: (at person15 city2)
   added: (in person15 plane5)
   goals met: 8 of 18
38. (fly plane5 city2 city10 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 9 of 18
39. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 18
40. (debark person15 plane5 city10)
   deleted: (in person15 plane5)
   added: (at person15 city10)
   goals met: 10 of 18
41. (fly plane5 city10 city4 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 9 of 18
42. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 18
43. (debark person9 plane5 city4)
   deleted: (in person9 plane5)
   added: (at person9 city4)
   goals met: 10 of 18
44. (fly plane5 city4 city5 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 10 of 18
45. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 18
46. (board person7 plane5 city5)
   deleted: (at person7 city5)
   added: (in person7 plane5)
   goals met: 10 of 18
47. (board person10 plane5 city5)
   deleted: (at person10 city5)
   added: (in person10 plane5)
   goals met: 10 of 18
48. (fly plane5 city5 city0 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 10 of 18
49. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 18
50. (debark person7 plane5 city0)
   deleted: (in person7 plane5)
   added: (at person7 city0)
   goals met: 11 of 18
51. (fly plane5 city0 city9 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 11 of 18
52. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 11 of 18
53. (debark person10 plane5 city9)
   deleted: (in person10 plane5)
   added: (at person10 city9)
   goals met: 12 of 18
54. (fly plane5 city9 city10 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 13 of 18
55. (fly plane4 city3 city0 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 13 of 18
56. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 18
57. (debark person14 plane4 city0)
   deleted: (in person14 plane4)
   added: (at person14 city0)
   goals met: 14 of 18
58. (fly plane4 city0 city1 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 14 of 18
59. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 18
60. (debark person13 plane4 city1)
   deleted: (in person13 plane4)
   added: (at person13 city1)
   goals met: 15 of 18
61. (fly plane4 city1 city10 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 15 of 18
62. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 18
63. (debark person5 plane4 city10)
   deleted: (in person5 plane4)
   added: (at person5 city10)
   goals met: 16 of 18
64. (fly plane4 city10 city6 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 16 of 18
65. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 18
66. (debark person2 plane4 city6)
   deleted: (in person2 plane4)
   added: (at person2 city6)
   goals met: 17 of 18
67. (fly plane4 city6 city4 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 18 of 18
